Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G44B.tmx
Source language: en_us
Languages: zh_cn

source: ABUELA
zh_cn: 我的祖母

source: MY PARENTS SEPARATED when I was two years old.
zh_cn: 在我两岁的时候，我父母分居了。

source: Needless to say I remember nothing of what was going on in my life at the time that happened, but I do know that I started spending a great deal of time with my grandparents on both my mother's and my father's sides.
zh_cn: 很显然，我并不记得当时发生了什么，我只知道从那时起我经常住在祖父或者外祖父家。

source: My grandparents played a key role in my life.
zh_cn: 我的祖父母和外祖父母在我生命中都十分重要。

source: I don't know if it's cultural or simply spiritual, but my relationship with them was always--and continues to be--very important to me.
zh_cn: 也不知道是因为文化的原因，还是是精神层面的原因，我和他们的关系一直都是一如既往地举足轻重。

source: I will never forget what they taught me, and I will strive to pass their teaching on to my sons.
zh_cn: 我永远不会忘记他们教导我的东西，我也会将这些教诲毫无保留地传递给我的孩子。

source: My paternal grandmother was an intelligent woman, independent and confident, a woman who was well ahead of her time.
zh_cn: 我祖母是一位充满智慧的女人，她独立而自信，并且一直走在时代前列。

source: She was into metaphysics long before it became fashionable.
zh_cn: 早在形而上学的哲学普及之前，她就开始研究这门学问。

source: She was also an artist; she painted and made sculptures.
zh_cn: 她同时也是一位艺术家，她曾作画并从事雕塑艺术。

source: I remember her as always being busy, doing one of the thousands of things that interested her.
zh_cn: 在我的记忆中，她一直都在忙她所钟爱的事情。

source: She didn't understand the concept of "staying still" and always had some kind of project going on.
zh_cn: 她的字典里似乎没有“暂停”这个词，她手头总是有这样或那样的事情在运作。

source: My great-grandmother--her mother--was a teacher, so my grandmother was practically raised in a classroom, listening to her mother's lectures.
zh_cn: 我的曾祖母，也就是我祖母的母亲，是一位老师，所以我祖母差不多是在教室里听着她妈妈讲课长大的。

source: She graduated from high school at fourteen, and even wrote two books and became a senior professor at the University of Puerto Rico.
zh_cn: 祖母14岁就从高中毕业，她写过两本书，而且还是波多黎各大学的高级教授。

source: Remember, we are talking about a time when society dictated that most women could only aspire to be mothers or housewives.
zh_cn: 要知道，在那个年代社会给女人们的职位无非是母亲和家庭主妇。

source: She was a surprising woman, so brave and such a visionary, that one day she decided to pack her bags and move to Boston to study education.
zh_cn: 祖母是一个令人惊叹的女人，她勇敢而充满理想，终于有一天她拿定主意决定收拾行囊远赴波士顿学习教育学。

source: In those times! But she moved to Boston and lived there until she graduated with a degree.
zh_cn: 在那个时代，这简直是一种疯狂的举动，就她去到了波士顿，并成功地获得了学位。

source: I recently had the opportunity to dine with Sonia Sotomayor, the first Latina judge of the United States Supreme Court, and when I told her about my grandmother's accomplishments, she was shocked.
zh_cn: 最近，我很荣幸能与美国最高法院首位拉丁裔大法官Sonia Sotomayor共进晚餐，并在席间我谈到了我祖母的种种经历，她也为此感到震惊：“

source: "A Latina woman studying in Boston in the forties?
zh_cn: 一位拉丁裔女人在40年代在波士顿学习？

source: Your grandmother must have been a strong woman," she said.
zh_cn: 你祖母一定是一位强人！”

source: And I of course felt very proud, because she was right: My grandmother was definitely an incredible lady.
zh_cn: 我理所当然地为我的祖母感到自豪，因为正如Sonia Sotomayor所言：她是一位无与伦比的女士。

source: Although she was born in Puerto Rico, my grandmother's family was originally from Corsica.
zh_cn: 尽管我祖母出生在波多黎各，但她的家人却来自科西嘉岛。

source: We Corsicans are famous for being stubborn, and my grandmother was no exception: She was a very strong woman who was never afraid of anything.
zh_cn: 我们科西嘉岛人是出了名的固执，我祖母当让不是例外。她强悍到从未畏惧过任何事情。

source: To me, she was always an example of what it means to be strong.
zh_cn: 对我而言，她就是“强人”的最好定义。

source: For example, after fifty-some years of marriage, she realized she was no longer feeling fulfilled, so one day she got up and said to my grandfather: "You know what? I want a divorce."
zh_cn: 比如，在结婚40多年之后，她感到自己不再能从婚姻中能得到满足感，所以一天起床之后，她向我的祖父说：“你知道么？我想离婚。”

source: In those days people got married for life, "until death do us part." It wasn't like today, when people get divorced for almost any reason at all.
zh_cn: 在那个年代，人们认为婚姻是要维持一辈子的，“直到死亡让我们分开”，不像今天人们可以以任何理由提出离婚。

source: But my grandmother didn't care what other people thought or said. For whatever reason, she wasn't happy and she decided to do something about it.
zh_cn: 但我祖母全然不顾别人是怎么想和怎么说；不管是什么原因，她不幸福了，所以她要改变这一切。

source: So my grandparents got divorced.
zh_cn: 就这样我祖父母离婚了。
